Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་གཟི་བརྗིད་སྟོབས། །ཤིང་སྲུངས་ཚེ་ན་བདེ་གཤེགས་ཞི་བ་ཡི། །བློ་གྲོས་དེ་ལ་སེའུ་འབྲུ་གཅིག་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Balatejojñāna, when a forest guard, Offered a pomegranate To the well-gone Intelligence of Peace And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགེ་བའི་སྒྲོན་མ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེ་དེ་ལ། །བ་སོའི་གཟིམས་ཁྲི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Kuśalapradīpa, when a merchant, Offered an ivory bedstead To the thus-gone Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཐུ་རྩལ་བརྟན་པོ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དམ་བཅས་བརྟན་པ་ལ། །ཨ་མྲའི་ཁུ་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhavikrama, when a brahmin, Offered mango juice To the thus-gone Firm Resolve And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་སྒྲ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་དེ་ལ་ནི། །པ་ལ་ཤི་ཀ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Devaruta, when a merchant, Offered palāśika flowers To the thus-gone Aim Accomplished And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རབ་ཞི་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕན་པར་དགྱེས་དེ་ལ། །ན་བཟའ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Praśānta, when a garment merchant, Offered robes To the thus-gone Delighting in Benefiting And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མའི་ཞལ་ནི་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་དེ་ལ། །རྫིང་བུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryānana, when a householder, Offered ponds To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐར་པའི་བརྟུལ་ཞུགས་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོང་བའི་ཤུགས་དེ་ལ། །པྲི་ཡང་ཀུ་ཡི་བསོད་སྙོམས་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mokṣavrata, when a destitute, Offered priyaṅgu as alms To the thus-gone Force of Abandonment And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚུལ་ཁྲིམས་འོད་ནི་དབུལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་གཏོང་དེ་ལ། །ཚོད་མའི་ཁུ་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śīlaprabha, when a poor man, Offered vegetable juice To the thus-gone Jewel Gift And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་གནས་པ་ཁྱིམ་བདག་གི། །བུ་མོའི་ཚེ་ན་བདེ་གཤེགས་ཡེ་ཤེས་ཤུགས། །དེ་ལ་ཨུད་པལ་ལྡ་ལྡི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vratasthita, when the daughter of a householder, Offered tassels of utpalas To the well-gone Force of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྡུལ་མེད་ཕྲེང་རྒྱུད་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟམ་པ་དེ་ལ་ནི། །པད་མ་འདབ་བརྒྱ་པ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arajas, when the daughter of a garland maker, Offered one hundred lotus petals To the thus-gone Bridge And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྙིང་པོ་འཕགས་པ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པ་བཟང་པོ་ལ། །རས་ཡུག་གཅིག་གིས་དགབ་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sārodgata, when a merchant, Covered the thus-gone Excellent Liberation With a length of cotton And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མིག་སྨན་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཚོགས་ནི་རྣམ་གནོན་ལ། །ཨ་མྲའི་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Añjana, when a guide, Offered mango fruit To the thus-gone Subjugator of the Gathering And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འཕེལ་མཛད་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་སྣང་བ་ལ། །གསེར་གདུགས་ཡུ་བ་བཻ་དཱུརྱས་བྱས་པ། །ཕུལ་ནས་དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vardhana, when a king, Offered a golden parasol with a handle of beryl To the thus-gone Splendid Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་འོད་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱམས་པའི་སྟོབས་དེ་ལ། །བྱུག་པ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gandhābha, when the son of a merchant, Offered an ointment To the thus-gone Strength of Love And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དུས་མཁྱེན་འོད་ནི་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་དཔལ་དེ་ལ། །ཁམ་པ་དག་ལས་བྱས་པའི་ལྷུང་བཟེད་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Velāmaprabha, when a potter, Offered a clay alms bowl To the thus-gone Moon Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲན་པའི་དབང་པོ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཞི་བའི་འོད་དེ་ཡི། །ལམ་དུ་ཟམ་པ་དག་ནི་བཙུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Smṛtīndra, when a merchant, Built bridges on the road For the thus-gone Light of Peace And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཞལ་བཟངས་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་ནི་སྡུག་དེ་ལ། །མེ་ཏོག་ཀུ་མུ་ད་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bhadravaktra, when a garland maker, Offered kumuda flowers To the thus-gone Lovely Eyes And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐོགས་མེད་རྒྱལ་མཚན་འདྲེག་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་ལྡན་དབྱངས་དེ་ཡི། །ཕྱག་གི་སེན་མོ་དག་ནི་བཅད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Asaṅgadhvaja, when a barber, Cut the nails on the hands Of the thus-gone Lunar Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བྱང་ཆུབ་མཆོག་བགྲོད་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་གཟུགས་དེ་ཡི། །སྤྱན་སྔར་ལམ་དག་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Varabodhigati, when a guide, Showed the way To the thus-gone Nectar Form And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱོད་གསལ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བློ་གྲོས་ལ། །མུ་ཏིག་དོ་ཤལ་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Caraṇaprasanna, when the son of a merchant, Scattered pearl necklaces Before the thus-gone Dharma Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་དགྱེས་པ་ཕྱག་དར་པ། །བྱེད་ཚེ་བདེ་གཤེགས་ཟླ་བ་ཆེན་པོ་ལ། །མཆོད་ཕྱིར་གླིང་བུ་དག་ནི་བུས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnapriya, when a sweeper, Played the flute as an offering To the well-gone Great Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་དབང་ཕྱུག་དགེ་སློང་ཚེ། །ཆོས་རྣམས་ཡང་དག་གཟུང་ཕྱིར་སེམས་བཏུད་ནས། །དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་དབྱངས་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmeśvara, when a monk, With veneration sought to retain all the teachings Of the thus-gone Unimpeded Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཐམས་ཅད་པ་གསེར་རྟོག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མེ་ཏོག་ལ། །གསེར་གྱིས་སྤར་བ་བཀང་སྟེ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Viśvadeva, when a gold expert, Scattered a handful of gold Before the thus-gone Divine FlowerAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཤེས་གཉེན་ཆེན་པོ་ཤིང་རྟ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་སྙོམས་པར་གཟིགས་དེ་ལ། །ཁང་བཟངས་དག་ནི་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahāmitra, when a chariot maker, Built a mansion and offered it To the well-gone Equanimous Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཤེས་གཉེན་བཟང་པོ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ཆེན་པོ་ལ། །སྣོད་དག་ཆུ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumitra, when a merchant, Offered a vessel filled with water To the thus-gone Great Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་ཏུ་ཞི་སྟབས་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་བཞེད་དེ་ལ། །རྩ་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśāntagāmin, when a guide, Offered roots To the thus-gone Acceptance of Merit And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩིའི་བདག་པོ་ཤིང་ཏོག་ཁྱེར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཕུང་པོ་བཅུ་པ་དེ་ལ་ནི། །ལྷུང་བཟེད་ཨ་མྲ་དག་གིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amṛtādhipa, when a fruit porter, Filled an alms bowl with mangoes as an offering To the thus-gone Ten Aggregates And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷུན་པོའི་འོད་ནི་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་འོད་དེ་ཡི། །གྲོང་ཁྱེར་དག་ནི་བླ་རེས་གཡོགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Meruprabha, when a king, Set up a canopy above the city Of the thus-gone Diverse Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཕགས་པས་བསྟོད་པ་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀླུ་ཡིས་བྱིན་པ་དེའི། །ལམ་སྲང་དག་ནི་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Āryastuta, when a guide, Showed the way To the thus-gone Nāga Gift And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྣང་ལྡན་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྲིན་གྱི་དབྱངས་དེ་ལ། །གསེར་ལས་བྱས་པའི་པད་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jyotiṣmat, when a householder, Offered a lotus flower of gold To the thus-gone Cloud Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་འབར་བ་རྩྭ་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐུ་རྩལ་ལ། །རྩྭ་སྟན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dīptatejas, when a straw collector, Offered a straw seat To the thus-gone Powerful Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྣང་གཟིགས་རྩིས་པའི་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་སེམས་དེ་ལ། །རིན་ཆེན་དྲ་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Avabhāsadarśin, when a young astrologer, Offered a net of jewels To the thus-gone Mind Endowed with Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་སྤྱད་རྣམ་སྨིན་བཅའ་བ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་སྤྲིན་གྱི་དབྱངས་དེ་ལ། །ལྷུང་བཟེད་བཅའ་བས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sucīrṇavipāka, when a cook, Filled an alms bowl with prepared food As an offering to the well-gone Cloud Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་པར་དགྱེས་པ་དཔའ་བོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་དབྱངས་དེ་ལ། །རྒྱལ་མཚན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Supriya, when a hero, Offered a banner To the thus-gone Clear Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་བྲལ་བ་རྩིས་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངན་སོང་སྤོང་བ་ལ། །མེ་ཏོག་རྣ་རྒྱན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vigataśoka, when an astrologer, Offered ear ornaments made of flowers To the thus-gone Relinquishing the Lower Realms And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འོད་ནི་དགེ་སློང་བསྙེན་བཀུར་བ། །བྱེད་ཚེ་དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མེ་ཏོག་ལ། །མར་མེ་དག་ནི་རབ་ཏུ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaprabhāsa, when venerating a monk, Offered butter lamps To the thus-gone Divine Flower And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་ལྡན་ཁྱིམ་བདག་ཚེ། །བསླབ་པའི་གཞི་ལྔ་དག་ནི་བཟུང་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་སྤྱན་མཛེས་ལྡན་པ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Cāritraka, when a householder, Took up the five bases for training Before the thus-gone Endowed with Beautiful Eyes And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་སྟོབས་ནི་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་ཆེན་པོ་ལ། །མལ་སྟན་ཤིང་བལ་ཅན་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyabala, when a householder, Offered a mattress filled with cotton To the thus-gone Great Lamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་རྒྱ་མཚོ་ཤིང་རྟ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་བརྟུལ་ཞུགས་ཆེན་པོ་དེའི། །གནས་ཁང་དག་ནི་བྱུག་པས་བྱུགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇasāgara, when a chariot maker, Anointed the residence Of the well-gone Great Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྨད་བྱུང་སྣང་མ་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟིགས་པ་བརྟན་དེ་ལ། །སྣང་མ་དག་ནི་བལྟམ་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Caitraka, when a servant, Offered service To the thus-gone Steadfast Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ང་སྤོང་རྒྱལ་པོའི་བཙུན་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མྱོས་པ་སྤོང་དེ་ལ། །མེ་ཏོག་ལྡ་ལྡི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mānajaha, when a queen, Offered tassels of flowers To the thus-gone Renouncing Intoxication And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་བརླག་མཛད་པ་དམག་མིའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཚན་གྱི་མེ་ཏོག་ལ། །མཆིལ་ལྷམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mārakṣayaṃkara, when a solider, Offered footwear To the thus-gone Flower of Marks And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བག་ཆགས་རྒལ་སྟབས་ཚོང་པའི་ཚེ། །བདེ་གཤེགས་བསམ་གྱིས་མི་ཁྱབ་འོད་དེ་ལ། །ཕྲེང་བ་དག་ལས་བྱས་པའི་བླ་རེ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vāsanottīrṇa­gati, when a merchant, Offered a canopy made of garlands To the well-gone Inconceivable Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་ཕྱེད་བློ་མངའ་ཤན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་འོད་དེ་ལ། །ཤིར་ཤའི་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Abhedyabuddhi, when a butcher, Offered a garland of śīrṣa To the thus-gone Universal Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྒྱ་མཚོ་དྲང་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ཡི། །སྤྱན་སྔར་གླུ་དབྱངས་དག་ནི་བླངས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Udadhi, when an honest person, Sang songs Before the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དག་མཛད་གྲོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་འོང་ཟླ་བ་ལ། །གསེར་གྱི་མེ་ཏོག་དག་གིས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śodhita, when the head of a town, Scattered golden flowers Before the thus-gone Delightful Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚོགས་ཅན་གྲོང་རྒྱལ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཛེས་པའི་དབྱངས་དེ་ལ། །ཁ་གཟར་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gaṇimuktirāja, when a merchant, Offered a ladle To the thus-gone Beautiful Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགའ་འོད་པད་མ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་མཆོག་དེ་ལ། །ཀ་རན་ཏ་ཀ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Priyābha, when an expert on lotuses, Offered a karaṇḍaka To the thus-gone Supreme Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བྱང་ཆུབ་རྒྱལ་མཚན་མདུན་འདོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །ཆོས་ལ་དགབ་པའི་ན་བཟའ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bodhidhvaja, when a priest, Offered fabric to cover Dharma texts To the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་རིན་ཆེན་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྙིང་པོ་ལ། །མེ་ཏོག་དག་ལས་བྱས་པའི་རྒྱལ་མཚན་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaratna, when a garland maker, Offered a banner made with flowers To the thus-gone Flower Essence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་བསིལ་བ་ཁྱིམ་བདག་གི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་ཡིད་གཏོད་ལ། །ནོར་བུ་རིན་ཆེན་མཆིལ་ལྷམ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suśītala, when the son of a householder, Offered footwear of precious jewels To the thus-gone Mental Focus And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་རྒྱལ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་སྦྱིན་བྱིན་པ་ལ། །གསེར་ལས་བྱས་པའི་གོས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmarāja, when a captain, Offered robes made with gold To the thus-gone Sacrifice Gift And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་དགྱེས་པ་ཤིང་རྟ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་ཡིད་བཞིན་འབྱོར་པ་ལ། །བཞུགས་ཁྲིའུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānarata, when a chariot maker, Offered a throne To the well-gone Wish-Fulfilling Wealth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྫུ་འཕྲུལ་ཏོག་ནི་གར་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པ་དགྱེས་དེ་ཡི། །སྤྱན་སྔར་བྲོ་གར་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ṛddhiketu, when a dancer, Performed a dance Before the thus-gone Delighting in Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་མཚུངས་པ་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དད་པས་བདེ་གཤེགས་སྟབས་འཇོག་ལ། །གསེར་སྐུད་དག་གིས་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendrakalpa, when the son of a merchant, Out of faith scattered threads of gold Before the well-gone Employing Gracefulness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ས་ཡི་དབང་ཕྱུག་རྔོན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་དག་འདུལ་བ་ལ། །རྩྭ་ལས་བྱས་པའི་མཆིལ་ལྷམ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharaṇīśvara, when a hunter, Offered footwear made from straw To the thus-gone Tamer of Enemies And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མ་དགྱེས་པ་ཕྱེ་མ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་ཡུལ་མེད་སྤོང་བ་ལ། །ཨུད་པལ་ཞལ་སྤོས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūryapriya, when an expert in powders, Offered facial perfume made from utpalas To the well-gone Total Relinquishment And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ཟླ་བ་གཞན་བྲན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་དེ་ལ། །རྩྭ་ཡི་ཁང་བཟངས་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhucandra, when a servant of others, Built a straw villa and offered it To the thus-gone Nectar Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མེ་ཏོག་འོད་ནི་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངར་མི་སེམས་པ་ལ། །མཆིལ་སྣོད་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṣpaprabha, when a monk, Offered a spittoon To the thus-gone No Thought of I And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྨན་པའི་བདག་པོ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡང་དག་སྒྲ་སྒྲོགས་ལ། །བཻ་དཱུརྱ་ལས་བྱས་པའི་གདུགས་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaidyādhipa, when a brahmin, Offered a parasol made of beryl To the thus-gone Proclaimer of Truth And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མདངས་མངའ་བཟང་ཀན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔག་མེད་སྤྱན་དེ་ལ། །ན་བཟའ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ojodhārin, when a tailor, Offered garments To the thus-gone Unfathomable Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བསོད་ནམས་དགྱེས་པ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་དཔའ་བོ་ལ། །མེ་ཏོག་ཟད་མི་ཤེས་པས་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Puṇyapriya, when a brahmin, Scattered inexhaustible flowers Before the thus-gone Hero of Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགའ་སྟོབས་རྔ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འབར་དེ་ལ་ནི། །རྔ་བོ་ཆེ་དག་བརྡུང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ratibala, when a drummer, Beat great drums Before the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་སྙན་ཕྱུག་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་ཚོགས་དེ་ལ། །གླིང་བུ་དག་ནི་བུད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sughoṣa, when a rich man, Played the flute Before the thus-gone Gathering of Qualities And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་དབང་ཕྱུག་བྲམ་ཟེའི་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་དུ་འོང་བའི་དབྱངས་དེ་ལ། །ཀུ་ཤ་དག་ལས་བྱས་པའི་ན་བཟའ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dharmeśvara, when the son of a brahmin, Offered robes made of kuśa grass To the thus-gone Compelling Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་དབྱངས་ཞིང་པའི་ཚེ། །བསོད་ནམས་འདོད་ཕྱིར་ཁྲོན་དྲུང་ཆུ་ཏོམ་བཞག །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་ཆེན་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmaruta, when a farmer, Placed a water bucket in front of a well with a wish for merit Before the thus-gone Great Intention And in so doing first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱོད་བཟང་བ་ལང་རྫི་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་ལྷ་དེ་ལ། །སྣོད་དག་ཞོ་ཡིས་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suceṣṭa, when a cattle herder, Offered a vessel filled with yogurt To the thus-gone God of Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཁྲུལ་མེད་བློ་ནི་གླིང་བུ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་སེམས་སྤྱོད་བདུད་རྩི་ལ། །ཡིད་དུ་འོང་བའི་སྒྲ་དག་བསྒྲགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Askhalita­buddhi, when a flute player, Offered delightful tones To the well-gone Nectar of Mindful Conduct And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དབྱངས་ཆེན་ཁྱིམ་བདག་ཚེ། །གཙུག་ལག་ཁང་ནི་སྟོང་སྙེད་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་གསལ་བ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Mahāpraṇāda, when a householder, Built thousands of monastic temples Before the thus-gone Clear Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྙན་གྲགས་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྒྲོན་མ་མཆོག་དེ་ལ། །ཕྲེང་བ་བརྒྱུས་པ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśaḥkīrti, when the son of a merchant, Offered strings of garlands To the thus-gone Supreme Lamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཏོག་ལྡན་ཤིང་ཐུན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་བརྟན་པ་ལ། །ཨུད་པལ་གསུམ་ཞིག་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ketumat, when a wood gatherer, Scattered three utpalas Before the thus-gone Steadfast Intelligence And in doing so first gave rise to the mind of awakening.
